app/Models/modeloProductos.php

    public function listarTodo()
    {
        $query = $this->db->table('tbl_productos pd');
        $query->select('*');
        $query->join('tbl_proveedor p', 'p.prov_id=pd.prov_id');
        $query->join('tbl_categorias c', 'c.cat_id=pd.cat_id');
        $query->orderBy('pd.prod_nombre', 'ASC');
        $valor = $query->get();
---
SELECT *
FROM `tbl_productos` `pd`
JOIN `tbl_proveedor` `p` ON `p`.`prov_id`=`pd`.`prov_id`
JOIN `tbl_categorias` `c` ON `c`.`cat_id`=`pd`.`cat_id`
ORDER BY `pd`.`prod_nombre` ASC