app/Models/modeloProductos.php

DELETE FROM `tbl_productos`
WHERE `prod_id` = '17'
---
    public function eliminarProducto($id)
    {
        $query = $this->db->table('tbl_productos');
        $query->where('prod_id', $id);
        $query->delete();