app/Models/modeloProductos.php

SELECT *
FROM `tbl_productos` `pd`
JOIN `tbl_categorias` `cat` ON `cat`.`cat_id`=`pd`.`cat_id`
JOIN `tbl_proveedor` `pv` ON `pv`.`prov_id`=`pd`.`prov_id`
ORDER BY `cat`.`cat_nombre` ASC
---
    public function listarDatos()
    {

        $sentencia = $this->db->table('tbl_productos pd');
        $sentencia->select('*');
        $sentencia->join('tbl_categorias cat', 'cat.cat_id=pd.cat_id');
        $sentencia->join('tbl_proveedor pv', 'pv.prov_id=pd.prov_id');
        $sentencia->orderBy('cat.cat_nombre', 'ASC');
        $valor = $sentencia->get();

SELECT *
FROM `tbl_productos` `pd`
JOIN `tbl_categorias` `cat` ON `cat`.`cat_id`=`pd`.`cat_id`
JOIN `tbl_proveedor` `pv` ON `pv`.`prov_id`=`pd`.`prov_id`
WHERE `pd`.`prod_id` = '4'
---
    public function listarxID($id)
    {
        $sentencia = $this->db->table('tbl_productos pd');
        $sentencia->select('*');
        $sentencia->join('tbl_categorias cat', 'cat.cat_id=pd.cat_id');
        $sentencia->join('tbl_proveedor pv', 'pv.prov_id=pd.prov_id');
        $sentencia->where('pd.prod_id', $id);

        $valor = $sentencia->get();

UPDATE `tbl_productos` `pd` SET `PROV_ID` = 'Lactios saludables S.A.'
WHERE `pd`.`prod_id` = '1'
---
    public function actualizar($id, $valor)
    {
        $sentencia = $this->db->table('tbl_productos pd');
        $sentencia->where('pd.prod_id', $id);
        $sentencia->update(['PROV_ID' => $valor]);